{
   "tutorial": [
       {
            "speaker" : "Jett",
            "dialogue" : "ALRIGHT EVERYBODY LISTEN UP, and especially *you*, Periwinkle.",
            "startScale" : "true",
            "shake" : "true"
       },
       {
            "speaker" : "Peri",
            "dialogue" : "( Aw man, I know I’m new but does he have to single me out like this?! )",
            "noTint" : "true"
        },
        {
            "speaker" : "Jett",
            "dialogue" : "YOU ALL KNOW THE DRILL! Move into formation with the **ARROW KEYS**! I’d advise you all to *NOT* bump into each other back there like a batch of squabbling penguins, YOU HEAR ME? If you do, there’ll be some tough consequences, no doubt about it!",
            "shake" : "true"
        },
        {
            "speaker" : "Peri",
            "dialogue" : "Yes, Sir!",
            "startScale" : "true"        
        },
        {
            "speaker" : "Jett",
            "dialogue" : "Once we’ve all *clicked* into our designated spots, it’ll be easy breezy beautiful from there and we’ll be at our destination in no time. THEN you can mingle amongst yourselves. Make some friends, or get ready for the next migration or something. Just come back to the flock in one piece and we’ll set off. ***LET’S MOVE OUT!***",
            "shake" : "true"
        },
        {
            "speaker" : "Peri",
            "dialogue" : "*sigh*...Here we go..."
        }
   ],
   
    "siesta": [      
        {
            "dialogue" : "Heeeeeey Peri...*yawn*...winkle. How goes it? Having fuuuuun with the new flock?",
            "noTint" : "true",
            "interupt" : "true"
        },
        {
            "dialogue" : "Let me cut you off there little guy, you’re going a liiiitle too fast for me--*yaaaaawn*...",
            "noTint" : "true",
            "interupt" : "true"
        },
        {
            "dialogue" : "Now see, I take it nice and slow and I don’t have to worry about anything. I don’t bump into other birds and I have all the time I want to get to my spot."
        },
        {
            "dialogue" : "It’s just me, this pillow, and the sky above me. Understand? (And don’t ask where I got the feathers for the pillow...)"
        },
        {
            "dialogue" : "Exaaaactly. Now let’s taaaaalk abooouutt-  *snoooooooooore*",
            "noTint" : "true",
            "interupt" : "true"
        }
    ],

    "sloane": [      
        {
            "dialogue" : "HELLO GOOD SIR!\n \nhello! hello!",
            "noTint" : "true",
            "interupt" : "true"
        },
        {
            "dialogue" : "I AM STRONG BIRD! Strongest bird in this flock and your new MENTOR, my fine fellow! \n \nnew mentor! new mentor!",
            "noTint" : "true",
            "interupt" : "true"
        },
        {
            "dialogue" : "My stature says nothing about my true strength, my feathered friend. It’s about COURAGE, VULNERABILITY, and the strength to follow your HEART that matters!",
            "noTint" : "true",
            "interupt" : "true",
            "choice1" : "true"
        },
        {
            "dialogue" : "YES! YOUR MENTOR! A guardian to teach you courage and the meaning of TRUE strength, what lies in your heart!",
            "noTint" : "true",
            "interupt" : "true",
            "choice2" : "true"
        },
        {
            "dialogue" : "I CAN ALSO TEACH YOU SO MANY OTHER THINGS, YOUNG LAD! SUCH AS FLYING AND…and…um…uh…not hitting other birds!"
        },
        {
            "dialogue" : "NOT HITTING THE OTHER BIRDS! Yes, what a brilliant idea from one such as myself! Such strong ideas from a strong bird! You, too, can be as shining as me, young one! What say you? \n \nsay you? say you?",
            "noTint" : "true",
            "interupt" : "true"
        }
    ],

    "kenneth": [      
        {
            "dialogue" : "Astounding! You’re a much better flier than I thought you would be. You’ve crossed off all of the beginner’s flying techniques on my list, and it’s not been more than your fifth time up there!",
            "noTint" : "true",
            "interupt" : "true"
        },
        {
            "dialogue" : "Let me introduce myself. I’m Kind bird! I’m the wisest bird in the flock and I’m here to help you with whatever you need, my little Polioptila Caerulea!",
            "noTint" : "true",
            "interupt" : "true"
        },
        {
            "dialogue" : "Well, according to my statistics I can see that you’re having a little trouble with finding your spot in the formations. With every bird flying all over the place, I completely understand why! That being said, what if I told you that I could calculate the exact spot you need to go to before we take off?",
            "noTint" : "true",
            "interupt" : "true"   
        },
        {
            "dialogue" : "No problem my fellow passerine! It’s my mission to help any bird in need because it’s the right thing to do.",
            "noTint" : "true",
            "interupt" : "true",
            "choice1" : "true"
        },
        {
            "dialogue" : "No matter where life takes you, remember always to be kind! You’ll make new friends and fly through life much, much easier that way.",
            "choice1" : "true"
        },
        {
            "dialogue" : "I do what I can to help anyone in need because it’s the right thing to do!",
            "noTint" : "true",
            "interupt" : "true",
            "choice2" : "true"
        },
        {
            "dialogue" : "We go through this world with so much strife on our wings, so what good is living if we can’t help out our fellow birds?",
            "choice2" : "true"
        },
        {
            "dialogue" : "Now then, I could lay out the math of how exactly I calculate your trajectory, but maybe it’d be best if we just do it in practice. Let’s take to the skies!"
        }
    ]
}

